---
type: FilterCategoryRule
namespace: Autodesk.Revit.DB
version: 2024
members: 4
tags: [revit-api, class]
---

# FilterCategoryRule

`Autodesk.Revit.DB.FilterCategoryRule` · Revit 2024 · 4 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | FilterCategoryRule | 2014 | `public FilterCategoryRule ( ICollection < ElementId > categories )` |
| Method | AllCategoriesFilterable | 2014 | `public static bool AllCategoriesFilterable ( ICollection < ElementId > categories )` |
| Method | GetCategories | 2014 | `public ICollection < ElementId > GetCategories ()` |
| Method | SetCategories | 2014 | `public bool SetCategories ( ICollection < ElementId > categories )` |